; domain
(define (domain satellite)
  (:requirements :strips :typing)
  (:types satellite direction instrument mode)
  (:predicates 
	(on_board ?i - instrument ?s - satellite)
	(supports ?i - instrument ?m - mode)
	(pointing ?s - satellite ?d - direction)
	(power_avail ?s - satellite)
	(power_on ?i - instrument)
	(calibrated ?i - instrument)
	(have_image ?d - direction ?m - mode)
	(calibration_target ?i - instrument ?d - direction))
 
  (:action turn_to
   :parameters (?s - satellite ?d_new - direction ?d_prev - direction)
   :precondition (and (pointing ?s ?d_prev))
   :effect (and  (pointing ?s ?d_new)
                 (not (pointing ?s ?d_prev))))
 
  (:action switch_on
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s) 
                      (power_avail ?s))
   :effect (and (power_on ?i)
                (not (calibrated ?i))
                (not (power_avail ?s))))

  (:action switch_off
   :parameters (?i - instrument ?s - satellite)
   :precondition (and (on_board ?i ?s)
                      (power_on ?i))
   :effect (and (not (power_on ?i))
                (power_avail ?s)))

  (:action calibrate
   :parameters (?s - satellite ?i - instrument ?d - direction)
   :precondition (and (on_board ?i ?s)
		      (calibration_target ?i ?d)
                      (pointing ?s ?d)
                      (power_on ?i))
   :effect (calibrated ?i))

  (:action take_image
   :parameters (?s - satellite ?d - direction ?i - instrument ?m - mode)
   :precondition (and (calibrated ?i)
                      (on_board ?i ?s)
                      (supports ?i ?m)
                      (power_on ?i)
                      (pointing ?s ?d))
   :effect (have_image ?d ?m)))

; problem
(define (problem strips-sat-x-1)
(:domain satellite)
(:objects
	satellite0 - satellite
	instrument0 - instrument
	instrument1 - instrument
	instrument2 - instrument
	satellite1 - satellite
	instrument3 - instrument
	satellite2 - satellite
	instrument4 - instrument
	instrument5 - instrument
	instrument6 - instrument
	satellite3 - satellite
	instrument7 - instrument
	instrument8 - instrument
	satellite4 - satellite
	instrument9 - instrument
	instrument10 - instrument
	satellite5 - satellite
	instrument11 - instrument
	instrument12 - instrument
	spectrograph0 - mode
	spectrograph1 - mode
	GroundStation4 - direction
	Star0 - direction
	GroundStation2 - direction
	GroundStation1 - direction
	Star3 - direction
	Star5 - direction
	Star6 - direction
	Planet7 - direction
	Planet8 - direction
	Planet9 - direction
	Star10 - direction
	Planet11 - direction
	Phenomenon12 - direction
	Phenomenon13 - direction
	Star14 - direction
	Star15 - direction
)
(:init
	(supports instrument0 spectrograph1)
	(calibration_target instrument0 Star3)
	(supports instrument1 spectrograph1)
	(calibration_target instrument1 GroundStation2)
	(calibration_target instrument1 Star5)
	(supports instrument2 spectrograph0)
	(calibration_target instrument2 Star5)
	(calibration_target instrument2 GroundStation4)
	(on_board instrument0 satellite0)
	(on_board instrument1 satellite0)
	(on_board instrument2 satellite0)
	(power_avail satellite0)
	(pointing satellite0 Star14)
	(supports instrument3 spectrograph1)
	(calibration_target instrument3 GroundStation2)
	(on_board instrument3 satellite1)
	(power_avail satellite1)
	(pointing satellite1 Phenomenon12)
	(supports instrument4 spectrograph0)
	(supports instrument4 spectrograph1)
	(calibration_target instrument4 GroundStation2)
	(calibration_target instrument4 Star6)
	(supports instrument5 spectrograph0)
	(calibration_target instrument5 Star5)
	(calibration_target instrument5 Star3)
	(supports instrument6 spectrograph1)
	(supports instrument6 spectrograph0)
	(calibration_target instrument6 GroundStation4)
	(calibration_target instrument6 Star5)
	(on_board instrument4 satellite2)
	(on_board instrument5 satellite2)
	(on_board instrument6 satellite2)
	(power_avail satellite2)
	(pointing satellite2 Star6)
	(supports instrument7 spectrograph1)
	(supports instrument7 spectrograph0)
	(calibration_target instrument7 Star3)
	(calibration_target instrument7 GroundStation2)
	(supports instrument8 spectrograph0)
	(calibration_target instrument8 GroundStation2)
	(calibration_target instrument8 Star0)
	(on_board instrument7 satellite3)
	(on_board instrument8 satellite3)
	(power_avail satellite3)
	(pointing satellite3 Star0)
	(supports instrument9 spectrograph0)
	(calibration_target instrument9 Star6)
	(calibration_target instrument9 GroundStation1)
	(supports instrument10 spectrograph0)
	(supports instrument10 spectrograph1)
	(calibration_target instrument10 Star3)
	(on_board instrument9 satellite4)
	(on_board instrument10 satellite4)
	(power_avail satellite4)
	(pointing satellite4 Phenomenon13)
	(supports instrument11 spectrograph0)
	(calibration_target instrument11 Star3)
	(calibration_target instrument11 GroundStation1)
	(supports instrument12 spectrograph0)
	(calibration_target instrument12 Star6)
	(calibration_target instrument12 Star5)
	(on_board instrument11 satellite5)
	(on_board instrument12 satellite5)
	(power_avail satellite5)
	(pointing satellite5 Star5)
)
(:goal (and
	(pointing satellite1 GroundStation1)
	(pointing satellite2 Phenomenon13)
	(pointing satellite5 Star3)
	(have_image Planet7 spectrograph1)
	(have_image Planet8 spectrograph1)
	(have_image Planet9 spectrograph0)
	(have_image Star10 spectrograph0)
	(have_image Planet11 spectrograph1)
	(have_image Phenomenon12 spectrograph1)
	(have_image Phenomenon13 spectrograph0)
	(have_image Star14 spectrograph1)
	(have_image Star15 spectrograph1)
))

)

; plan
1. (turn_to satellite5 star3 star5)
   deleted: (pointing satellite5 star5)
   added: (pointing satellite5 star3)
   goals met: 1 of 12
2. (switch_on instrument4 satellite2)
   deleted: (power_avail satellite2)
   added: (power_on instrument4)
   goals met: 1 of 12
3. (calibrate satellite2 instrument4 star6)
   added: (calibrated instrument4)
   goals met: 1 of 12
4. (turn_to satellite2 planet8 star6)
   deleted: (pointing satellite2 star6)
   added: (pointing satellite2 planet8)
   goals met: 1 of 12
5. (take_image satellite2 planet8 instrument4 spectrograph1)
   added: (have_image planet8 spectrograph1)
   goals met: 2 of 12
6. (turn_to satellite2 planet7 planet8)
   deleted: (pointing satellite2 planet8)
   added: (pointing satellite2 planet7)
   goals met: 2 of 12
7. (take_image satellite2 planet7 instrument4 spectrograph1)
   added: (have_image planet7 spectrograph1)
   goals met: 3 of 12
8. (turn_to satellite2 planet11 planet7)
   deleted: (pointing satellite2 planet7)
   added: (pointing satellite2 planet11)
   goals met: 3 of 12
9. (take_image satellite2 planet11 instrument4 spectrograph1)
   added: (have_image planet11 spectrograph1)
   goals met: 4 of 12
10. (turn_to satellite2 phenomenon12 planet11)
   deleted: (pointing satellite2 planet11)
   added: (pointing satellite2 phenomenon12)
   goals met: 4 of 12
11. (turn_to satellite1 groundstation1 phenomenon12)
   deleted: (pointing satellite1 phenomenon12)
   added: (pointing satellite1 groundstation1)
   goals met: 5 of 12
12. (take_image satellite2 phenomenon12 instrument4 spectrograph1)
   added: (have_image phenomenon12 spectrograph1)
   goals met: 6 of 12
13. (turn_to satellite2 planet9 phenomenon12)
   deleted: (pointing satellite2 phenomenon12)
   added: (pointing satellite2 planet9)
   goals met: 6 of 12
14. (take_image satellite2 planet9 instrument4 spectrograph0)
   added: (have_image planet9 spectrograph0)
   goals met: 7 of 12
15. (turn_to satellite2 star10 planet9)
   deleted: (pointing satellite2 planet9)
   added: (pointing satellite2 star10)
   goals met: 7 of 12
16. (take_image satellite2 star10 instrument4 spectrograph0)
   added: (have_image star10 spectrograph0)
   goals met: 8 of 12
17. (turn_to satellite2 star14 star10)
   deleted: (pointing satellite2 star10)
   added: (pointing satellite2 star14)
   goals met: 8 of 12
18. (take_image satellite2 star14 instrument4 spectrograph1)
   added: (have_image star14 spectrograph1)
   goals met: 9 of 12
19. (turn_to satellite2 star15 star14)
   deleted: (pointing satellite2 star14)
   added: (pointing satellite2 star15)
   goals met: 9 of 12
20. (take_image satellite2 star15 instrument4 spectrograph1)
   added: (have_image star15 spectrograph1)
   goals met: 10 of 12
21. (turn_to satellite2 phenomenon13 star15)
   deleted: (pointing satellite2 star15)
   added: (pointing satellite2 phenomenon13)
   goals met: 11 of 12
22. (take_image satellite2 phenomenon13 instrument4 spectrograph0)
   added: (have_image phenomenon13 spectrograph0)
   goals met: 12 of 12
